namespace Script.I200.Entity.Enum
{
    /// <summary>
    /// 短信发送状态
    /// </summary>
    public enum SmsStatus : int
    {
        等待发送 = 0,
        已提交 = 1,
        正在发送 = 2,
        发送失败 = 3
    }

    /// <summary>
    /// 短信类型
    /// </summary>
    public enum SmsType : int
    {
        重置密码 = 0,
        短信营销 = 1,
        充值提醒 = 2,
        电子账单 = 3,
        店铺经营 = 4,
        会员注册 = 6,
        生日祝福 = 7,
        日程提醒 = 8,
        用户注册 = 9,
        密码找回 = 10,
        订单提醒 = 11,
        回访营销 = 12,
        店铺邀请验证 = 13,
        反馈回复 = 14,
        电子优惠券 = 15,
        手机橱窗登录 = 16,
        手机橱窗验证 = 17,
        手机橱窗流程短信提示 = 18,
        测试短信 = 99
    }
}
